#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>


int main()
{
	float f = 5.5;
	//十进制：5.5
	//二进制：101.1
	//按标准表示：（-1）^0*1.011*2^2
	//S=0
	//M=1.011
	//E=2(加上中间数127得到的值是129）
	//在内存中的存储：0 10000001 01100000000000000000000
	//规范化处理：01000000 10110000 00000000 00000000
	//规范化处理：0100 0000 1011 0000 0000 0000 0000 0000
	//十六进制显示：0x 40 b0 00 00 (可以调试，在内存中查看，ps：x64是小端存储）

	return 0;
}


//int main()
//{
//	int n = 9;
//	float* pfloat = (float*)&n;
//	printf("%d\n", n);
//	printf("%f\n", *pfloat);
//
//	*pfloat = 9.0;
//	printf("%d\n", n);
//	printf("%f\n", *pfloat);
//	
//	return 0;
//
//}

//int main()
//{
//	double d = 1E10;
//	printf("%lf\n", d);
//
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	unsigned char i = 0;
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello, world!\n");
//	}
//	return 0;
//}

//#include <stdio.h>
//
//#include <string.h>
//
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}


//#include <Windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(500);
//	}
//	return 0;
//}


//int main()
//{
//	int i = -20;
//	//原码：10000000 00000000 00000000 00010100
//	//反码：11111111 11111111 11111111 11101011
//	//补码：11111111 11111111 11111111 11101100
//	int j = 10;
//	//正数三码相同：00000000 00000000 00000000 00001010
//	printf("%d\n", i + j);
//	//二者相加：
//	//11111111 11111111 11111111 11101100
//	//00000000 00000000 00000000 00001010
//
//	//11111111 11111111 11111111 11110110(结果，是以补码形式存储的
//	//反码：11111111 11111111 11111111 11110101（补码减1）
//	//原码：10000000 00000000 00000000 00001010
//	//转为有符号数：%d-> -10
//
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	char b = 128;
//	// char类型只能存储一个byte
//	// signed char的范围是：-128~127
//	// unsigned char的范围是：0~255
//	// 原码：10000000 00000000 00000000 10000000
//	// 反码：11111111 11111111 11111111 01111111
//	// 补码：11111111 11111111 11111111 10000000
//	// 强制转换为char类型后： 10000000
//	printf("%c\n", a);//此时输出的是a保存的值对应的ascii码
//	printf("%c\n", 128);//此时输出的是128对应的ascii字符
//	//当转换成%u之后，会进行整型提升
//	//整型提升是按照变量的数据类型的符号位来提升的
//	//因此 下列打印的值其实是无符号的：11111111 11111111 11111111 10000000
//	printf("%u\n", a);// %u是打印十进制无符号数字 %d是打印十进制有符号数字
//
//	printf("%c\n", b);
//	printf("%c\n", 128);
//	printf("%u\n", b);
//
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	//这个程序输出什么？
//	printf("%d %d %d\n", a, b, c);
//
//	return 0;
//}

//int SysCheck(void)
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;
//}
//
//int main()
//{
//	//写一段代码判断当前机器的字节序是什么？
//	//返回1，小端
//	//返回0，大端
//	if (SysCheck())
//	{
//		printf("当前机器是小端\n");
//	}
//	else
//	{
//		printf("当前机器是大端\n");
//	}
//	return 0;
//}



//int main()
//{
//	int a = 0x01;
//	char* pc = &a;
//
//	if ('\0' == *pc)
//	{
//		printf("大端存储\n");
//	}
//	else if ('\1' == *pc)
//	{
//		printf("小端存储\n");
//	}
//	else
//		printf("err\n");
//	return 0;
//}




//int main()
//{
//	int a = 20;
//	//00000000 00000000 00000000 00010100-原码
//	//00000000 00000000 00000000 00010100-反码
//	//00000000 00000000 00000000 00010100-补码
//	//16进制：0x 00 00 00 14
//	int b = -20;
//	//10000000 00000000 00000000 00010100-原码
//	//11111111 11111111 11111111 11101011-反码
//	//11111111 11111111 11111111 11101100-补码
//	//16进制：0x ff ff ff ec
//
//	return 0;
//}


